# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [13]:
#Your code here
import sqlite3
import pandas as pd

connection = sqlite3.connect('data.sqlite')
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
cursor.execute('''SELECT firstname, lastname, city FROM employees
LEFT JOIN offices using (officeCode)
WHERE city = "Boston"''').fetchall()

[('Julie', 'Firrelli', 'Boston'), ('Steve', 'Patterson', 'Boston')]

## Do any offices have no employees?

In [4]:
#Your code here
cursor.execute(''' SELECT * FROM employees
LEFT JOIN offices using (officeCode)
WHERE CITY IS NULL
''').fetchall()

[]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [15]:
# Your code here
cursor.execute('''SELECT productName, firstname, lastname from products
JOIN orderDetails using(productCode)
JOIN orders using(orderNumber)
JOIN customers using(customerNumber)
JOIN employees on customers.salesRepEmployeeNumber = employees.employeenumber
ORDER BY firstname''')

df = pd.DataFrame(cursor.fetchall())
print(len(df))
df.head()

2996

                                       0     1       2
0  1969 Harley Davidson Ultimate Chopper  Andy  Fixter
1  1969 Harley Davidson Ultimate Chopper  Andy  Fixter
2               1952 Alpine Renault 1300  Andy  Fixter
3               1952 Alpine Renault 1300  Andy  Fixter
4               1952 Alpine Renault 1300  Andy  Fixter

## Level Up: Display the Number of Products each Employee Has sold

In [16]:
#Your code here
df.groupby([1,2]).count()

                      0
1        2
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!